{
    "data": [
        {
            "title": "Programmer",
            "company": "PT.Asia Sistem Indonesia",
            "category": "Full Time",
            "duration": "Dec 2024 - Juli 2025",
            "description": "",
            "subDescription": [
                "Analyze business needs and translate them into technical specifications",
                "Identify and resolve performance bottlenecks",
                "Developed web-based Geographic Information System (GIS) application.",
                "Maintain regular communication with client, providing updates on project progress concerns",
                "Working with Active Directory, Nodejs, Reactjs, Postgresql"
            ]
        },
        {
            "title": "Fullstack Web Deveoper",
            "company": "PT. Subaga Digital Medika",
            "category": "Full Time",
            "duration": "Aug 2023 - Juli 2024",
            "description": "With experience in the hospital, I've served as a Fullstack Developer, ensuring the successful implementation and maintained web-based Hospital Management System (SIMRS covering modules such as Medical Records & Patient Services, Finance, Facilities & Infrastructure, Pharmacy Warehouse, Human Resources, and Management. My responsibilities include:",
            "subDescription": [
                "Understanding the hospital workflow and Training users.",
                "Diagnosed and resolved application bugs, feature customization, and enhanced system performance.",
                "Integrating with E-Klaim BPJS API for national health insurance claim processing and Implementing bridging for integration of medical devices with hospital systems.",
                "Working with Laravel, Angular, and PostgreSQL, Linux."
            ]
        },
        {
            "title": "WMS Application Go-Live Trainer",
            "company": "PT. Sinergi Digital Solusindo",
            "category": "Freelance",
            "duration": "Jun 2022 (1 week)",
            "description": "When I was a bachelor's student, I took a job as a freelance trainer for one week at PT.Pertamina Lubricants, based on DSP Batakan, Balikpapan. My daily job was to:",
            "subDescription": [
                "Delivered on-site training for employees at PT. Pertamina Lubricants (DSP Batakan, Balikpapan) on the use of WMS (Warehouse Management System) applications during system go-live.",
                "Guided staff in executing inbound and outbound warehouse processes using the WMS (Warehouse Management System) platform.",
                "Identified, documented, and reported system issues or user challenges to WMS customer support for timely resolution."
            ]
        },
        {
            "title": "Study Independent React JS Front-End Engineer",
            "company": "Alterra Academy ",
            "category": "Internship",
            "duration": "Feb 2022 - May 2022",
            "description": "I also participated in a Study independent Program at Kampus Merdeka. I asked many questions and learned about web development. My daily tasks included:",
            "subDescription": [
                "Learned and app",
                "lied front-end technologies: React.js, Redux, GraphQL, Figma, Git, and deployment tools.",
                "Built multiple mini-projects",
                "Completed daily coding tasks"
            ]
        },
        {
            "title": "Frontend Web Developer",
            "company": "PT. Gama Informatika",
            "category": "Internship",
            "duration": "Sep 2021 - Jan 2022 ",
            "description": "",
            "subDescription": [
                 "Translated UI/UX wireframes into functional and interactive user interfaces.",
                 "Integrate APIs provided by the backend team to display dynamic content.",
                 "Devlop the frontend using the Angular framework",
                 "Collaborate with the System Analyst, UI/UX designer, and Backend",
                 "Participated in mentorship sessions covering topics such as System Analysis, UI/UX Design Principles, Git & GitHub, CI/CD workflows, Angular, and Lumen with JWT authentication."
            ]
        },
        {
            "title": "Assistant Lecturer",
            "company": "Universitas Teknologi Yogyakarta",
            "category": "Contract",
            "duration": "Aug 2021 - Jan 2022",
            "description": "",
            "subDescription": [
                "Instructed a web programming lab course",
                "Prepared and delivered weekly instructional materials on HTML, CSS, JavaScript, PHP, jQuery, and MySQL.",
                "Designed, assigned, and assessed weekly programming assignments to enhance student understanding and application."
            ]
        },
        {
            "title": "Web Programmer",
            "company": "SEVEN INC JOGJA",
            "category": "Internship",
            "duration": "Sep 2021 - Dec 2021",
            "description": "",
            "subDescription": [
                "Working with Ci4",
                "Fixing bugs at Djuragan.com- Working with Ci4 - Fixing bugs at Djuragan.com"
            ]
        }
    ]
}
